MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
/* --- Audio Thread --- */
#define AUDIO_SAMPLE_RATE 16000
#define AUDIO_SAMPLES_PER_BLOCK 512
#define AUDIO_BLOCK_SIZE (AUDIO_SAMPLES_PER_BLOCK * sizeof(int16_t))
K_MEM_SLAB_DEFINE(audio_mem_slab, AUDIO_BLOCK_SIZE, 24, 4);

static struct k_thread audio_thread_data;
static struct k_thread sensor_thread_data;
K_THREAD_STACK_DEFINE(audio_stack, 2048);
K_THREAD_STACK_DEFINE(sensor_stack, 2048);

static void audio_thread(void *p1, void *p2, void *p3)
{
	void *buffer;
	size_t size;
	int ret;
	uint32_t val_u32;

	if (device_is_ready(gpio1_dev)) {
		gpio_pin_configure(gpio1_dev, SENSE_PWR_PIN, GPIO_OUTPUT_HIGH);
		gpio_pin_set(gpio1_dev, SENSE_PWR_PIN, 1);
		k_msleep(100);
	} else {
		printk("AUDIO: gpio1_dev not ready\n");
	}

	if (!device_is_ready(mic_dev)) {
		printk("AUDIO: mic_dev not ready\n");
		return;
	}

	struct pcm_stream_cfg stream_cfg = {
		.pcm_rate = AUDIO_SAMPLE_RATE,
		.pcm_width = 16,
		.block_size = AUDIO_BLOCK_SIZE,
		.mem_slab = &audio_mem_slab,
	};

	struct dmic_cfg cfg;
	memset(&cfg, 0, sizeof(cfg));
	cfg.io.min_pdm_clk_freq = 1000000;
	cfg.io.max_pdm_clk_freq = 3200000;
	cfg.streams = &stream_cfg;
	cfg.channel.req_chan_map_lo = dmic_build_channel_map(0, 0, PDM_CHAN_LEFT);
	cfg.channel.req_num_chan = 1;
	cfg.channel.req_num_streams = 1;

	if (dmic_configure(mic_dev, &cfg) < 0) {
		printk("AUDIO: dmic_configure failed\n");
		return;
	}
	if (dmic_trigger(mic_dev, DMIC_TRIGGER_START) < 0) {
		printk("AUDIO: dmic_trigger failed\n");
		return;
	}
	printk("AUDIO: PDM started, waiting for samples\n");

	while (1) {
		ret = dmic_read(mic_dev, 0, &buffer, &size, SYS_FOREVER_MS);
		if (ret != 0) {
			printk("DMIC Read Error: %d\n", ret);
			k_msleep(10);
			continue;
		}
		
		if (ret == 0) {
			int16_t *samples = (int16_t *)buffer;
			uint32_t count = size / sizeof(int16_t);
			
			double sum_sq = 0;
			uint32_t zero_crossings = 0;
			int16_t last_sample = 0;

			for (uint32_t i = 0; i < count; i++) {
				/* RMS Calculation */
				double val = (double)samples[i] / 32768.0;
				sum_sq += val * val;

				/* Zero-Crossing Rate (ZCR) Calculation */
				/* Check if the sign changed compared to the last sample, ignore exactly 0 to avoid noise jitter */
				if (i > 0) {
					if ((samples[i] > 0 && last_sample < 0) || (samples[i] < 0 && last_sample > 0)) {
						zero_crossings++;
					}
				}
				last_sample = samples[i];
			}
			
			double rms = sqrt(sum_sq / (double)count);
			
			/* Pack data for BLE: [4 bytes RMS] [4 bytes ZCR] */
			val_u32 = (uint32_t)(rms * 1000.0);
			sys_put_le32(val_u32, &audio_level_buf[0]);
			sys_put_le32(zero_crossings, &audio_level_buf[4]);
			
			/* RGB LED Audio Logic (Highly Smoothed for Fade-out effect) */
			static double smoothed_rms = 0.0;
			const double decay_factor = 0.885; /* Very slow fade-out */
			const double attack_factor = 0.12; /* Smoother build-up */

			if (rms > smoothed_rms) {
				smoothed_rms = (attack_factor * rms) + ((1.0 - attack_factor) * smoothed_rms);
			} else {
				smoothed_rms *= decay_factor;
			}

			if (oled_settings.led_enable && gpio_is_ready_dt(&led_red_spec) && gpio_is_ready_dt(&led_green_spec) && gpio_is_ready_dt(&led_blue_spec)) {
				if (smoothed_rms < 0.004) { /* Silence */
					gpio_pin_set_dt(&led_red_spec, 0); gpio_pin_set_dt(&led_green_spec, 0); gpio_pin_set_dt(&led_blue_spec, 0);
				} else if (smoothed_rms < 0.012) { /* Low: Cyan/Blue */
					gpio_pin_set_dt(&led_red_spec, 0); gpio_pin_set_dt(&led_green_spec, 1); gpio_pin_set_dt(&led_blue_spec, 1);
				} else if (smoothed_rms < 0.025) { /* Mid: Green */
					gpio_pin_set_dt(&led_red_spec, 0); gpio_pin_set_dt(&led_green_spec, 1); gpio_pin_set_dt(&led_blue_spec, 0);
				} else if (smoothed_rms < 0.045) { /* High: Yellow */
					gpio_pin_set_dt(&led_red_spec, 1); gpio_pin_set_dt(&led_green_spec, 1); gpio_pin_set_dt(&led_blue_spec, 0);
				} else { /* Peak: Red */
					gpio_pin_set_dt(&led_red_spec, 1); gpio_pin_set_dt(&led_green_spec, 0); gpio_pin_set_dt(&led_blue_spec, 0);
				}
			}

			if (bt_connected_flag) {
				bt_gatt_notify(NULL, &custom_svc.attrs[IDX_AUDIO_VAL], audio_level_buf, sizeof(audio_level_buf));
			}
			k_mem_slab_free(&audio_mem_slab, buffer);
			if (k_uptime_get_32() % 1000 < 50) {
				printk("Mic RMS: %u\n", val_u32);
			}
		}
	}
}

static void sensor_thread(void *p1, void *p2, void *p3)
{
	struct sensor_value accel[3], gyro[3];
	int32_t ax, ay, az, gx, gy, gz;

	if (device_is_ready(imu_dev)) {
		struct sensor_value odr = { .val1 = 52, .val2 = 0 };
		sensor_attr_set(imu_dev, SENSOR_CHAN_ACCEL_XYZ, SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
		sensor_attr_set(imu_dev, SENSOR_CHAN_GYRO_XYZ, SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
	}

	while (1) {
		if (sensor_sample_fetch(imu_dev) == 0) {
			sensor_channel_get(imu_dev, SENSOR_CHAN_ACCEL_XYZ, accel);
			sensor_channel_get(imu_dev, SENSOR_CHAN_GYRO_XYZ, gyro);
			
			ax = my_sensor_value_to_milli(&accel[0]);
			ay = my_sensor_value_to_milli(&accel[1]);
			az = my_sensor_value_to_milli(&accel[2]);
			gx = my_sensor_value_to_milli(&gyro[0]);
			gy = my_sensor_value_to_milli(&gyro[1]);
			gz = my_sensor_value_to_milli(&gyro[2]);
			
			sys_put_le32(ax, &accel_data.data[0]);
			sys_put_le32(ay, &accel_data.data[4]);
			sys_put_le32(az, &accel_data.data[8]);
			sys_put_le32(gx, &gyro_data.data[0]);
			sys_put_le32(gy, &gyro_data.data[4]);
			sys_put_le32(gz, &gyro_data.data[8]);
			
			bt_gatt_notify(NULL, &custom_svc.attrs[IDX_ACCEL_VAL], &accel_data, sizeof(accel_data));
			bt_gatt_notify(NULL, &custom_svc.attrs[IDX_GYRO_VAL], &gyro_data, sizeof(gyro_data));
		}
		k_msleep(20); /* Wiederhergestellt auf 50Hz wie vom User gewünscht */
	}
}

/* --- NFC Logic --- */
static uint8_t nfc_ndef_msg_buf[256]; /* Vergrößert auf 256 Bytes */

static void nfc_callback(void *context, nfc_t2t_event_t event, const uint8_t *data, size_t data_len)
{
	switch (event) {
	case NFC_T2T_EVENT_FIELD_ON:
		printk("NFC: Field detected (Smartphone nearby)\n");
		break;
	case NFC_T2T_EVENT_FIELD_OFF:
		printk("NFC: Field lost\n");
		break;
	default:
		break;
	}
}

static int setup_nfc(void)
{
	int err;
	size_t len = sizeof(nfc_ndef_msg_buf);

	err = nfc_t2t_setup(nfc_callback, NULL);
	if (err) {
		printk("NFC setup failed (err %d)\n", err);
		return err;
	}

