MikeProStudio/nRF52840-Bluetooth-Sensor-Hub/src/main.c
	oled_flush();
}

static void oled_check_sleep(void)
{
	oled_last_activity = k_uptime_get();
	if (oled_settings.display_sleep_min > 0 && device_is_ready(oled_dev)) {
		display_blanking_off(oled_dev);
	}
}

static void oled_work_handler(struct k_work *work)
{
	if (oled_settings.display_sleep_min > 0 &&
	    k_uptime_get() - oled_last_activity > (int64_t)oled_settings.display_sleep_min * 60000) {
		if (device_is_ready(oled_dev)) {
			display_blanking_on(oled_dev);
		}
		k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(30));
		return;
	}

	if (oled_phase == PHASE_WELCOME) {
		oled_clear();
		oled_puts(16, 24, "Welcome!");
		oled_flush();
		generate_qr_code();
		oled_sub_phase = 0;
		if (oled_settings.qr_enable) {
			oled_phase = PHASE_QR;
			qr_view_start = k_uptime_get();
		} else {
			oled_phase = PHASE_BEACON;
		}
		oled_last_activity = k_uptime_get();
		k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(2));
	} else if (bt_connected_flag) {
		oled_last_activity = k_uptime_get();
		if (oled_sub_phase == 0) {
			oled_update_connected();
			if (oled_settings.view_override == 2) {
				mic_view_start = k_uptime_get();
				oled_sub_phase = 1;
			} else if (oled_settings.view_override == 1 || k_uptime_get() - imu_view_start < (int64_t)oled_settings.imu_dwell_s * 1000) {
				;
			} else {
				mic_view_start = k_uptime_get();
				oled_sub_phase = 1;
			}
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
		} else {
			oled_update_mic();
			if (oled_settings.view_override == 2 || k_uptime_get() - mic_view_start < (int64_t)oled_settings.mic_dwell_s * 1000) {
				;
			} else {
				imu_view_start = k_uptime_get();
				oled_sub_phase = 0;
			}
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(150));
		}
	} else if (oled_phase == PHASE_QR && oled_settings.qr_enable) {
		oled_draw_qr_code();
		if (k_uptime_get() - qr_view_start < (int64_t)oled_settings.qr_dwell_s * 1000) {
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_MSEC(500));
		} else {
			oled_phase = PHASE_BEACON;
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_NO_WAIT);
		}
	} else {
		oled_update_display();
		oled_sub_phase = 0;
		if (oled_settings.view_override == 1 || !oled_settings.qr_enable) {
			oled_phase = PHASE_BEACON;
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(oled_settings.beacon_dwell_s));
		} else {
			oled_phase = PHASE_QR;
			qr_view_start = k_uptime_get();
			k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(oled_settings.beacon_dwell_s));
		}
	}
}

int main(void) {
	if (gpio_is_ready_dt(&led_red_spec)) { gpio_pin_configure_dt(&led_red_spec, GPIO_OUTPUT_INACTIVE); }
	if (gpio_is_ready_dt(&led_green_spec)) { gpio_pin_configure_dt(&led_green_spec, GPIO_OUTPUT_INACTIVE); }
	if (gpio_is_ready_dt(&led_blue_spec)) { gpio_pin_configure_dt(&led_blue_spec, GPIO_OUTPUT_INACTIVE); }
	
	usb_enable(NULL);

	bt_conn_auth_cb_register(&auth_cb_display);
	bt_conn_auth_info_cb_register(&auth_info_cb);

	/* Generate a unique, constant 6-digit PIN from Hardware FICR DeviceAddress */
	generated_passkey = (nrf_ficr_deviceaddr_get(NRF_FICR, 0) % 900000) + 100000;
	bt_passkey_set(generated_passkey);
	printk("----------------------------------\n");
	printk("DEVICE UNIQUE PIN: %06u\n", generated_passkey);
	printk("----------------------------------\n");

	/* Settings müssen VOR bt_enable() geladen werden, damit die BT-Identität (BLE-Address)
	   aus NVS restaured wird und nach Power-Cycle gleich bleibt */
	if (IS_ENABLED(CONFIG_BT_SETTINGS)) {
		settings_load();
	}

	int err = bt_enable(NULL);
	if (err) {
		printk("Bluetooth init failed (err %d)\n", err);
		return 0;
	}

	bt_conn_cb_register(&conn_callbacks_phy);

	/* Initialize NFC after BT is ready so we can fetch the device address */
	setup_nfc();

	/* Initialize OLED display */
	oled_init();
	oled_apply_settings();

	k_work_init(&adv_start_work, adv_start_handler);

	bt_ready_init();
	k_thread_create(&audio_thread_data, audio_stack, K_THREAD_STACK_SIZEOF(audio_stack), audio_thread, NULL, NULL, NULL, 2, K_FP_REGS, K_NO_WAIT);
	k_thread_create(&sensor_thread_data, sensor_stack, K_THREAD_STACK_SIZEOF(sensor_stack), sensor_thread, NULL, NULL, NULL, 3, K_FP_REGS, K_NO_WAIT);

	/* Initialize and start periodic battery monitoring */
	k_work_init_delayable(&batt_work, batt_work_handler);
	k_work_reschedule(&batt_work, K_NO_WAIT);

	/* Initialize and start periodic status monitoring */
	k_work_init_delayable(&status_work, status_work_handler);
	k_work_reschedule(&status_work, K_NO_WAIT);

	/* Initialize and start periodic OLED update */
	k_work_queue_start(&oled_work_q, oled_work_q_stack,
			   K_THREAD_STACK_SIZEOF(oled_work_q_stack),
			   4, NULL);
	k_work_init_delayable(&oled_work, oled_work_handler);
	k_work_reschedule_for_queue(&oled_work_q, &oled_work, K_SECONDS(1));

	while (1) {
		/* The main loop is now very light, everything is handled by threads and workqueues.
		   We sleep for a longer time to save power. */
		k_msleep(1000);
	}
	return 0;
}
